backend: "python"
max_batch_size: 32
input [
    {
        name: "image"
        data_type: TYPE_FP32
        dims: [ 1, 28, 28 ]
    }
]

output [
    {
        name: "output__0"
        data_type: TYPE_INT64
        dims: [ 10 ]
    }
]

parameters {
    key: "base_params"
    value: {
        string_value: "/app/inference_triton/model_repository/add_sub/1/mnist_cnn.pt"
    }
}